[
    {
        "function_name": "__encode_digit",
        "summary": "This function is used to encode a single digit (0-9) into its corresponding Roman numeral representation based on its position (index) in a hierarchical structure. The function takes an index (representing the place value, such as units, tens, hundreds, etc.) and a value (the digit to be encoded) as inputs. It uses a predefined mapping (`cls.__mappings`) to determine the appropriate Roman numeral symbols for the given digit and its position. The function handles different cases for the digit value, such as zero (no symbol), values 1-3 (repeated symbols), 4 (subtractive notation), 5 (direct mapping), 6-8 (additive notation), and 9 (subtractive notation with the next higher unit). The result is a string representing the Roman numeral for the given digit and position."
    },
    {
        "function_name": "encode",
        "summary": "This function is used to convert a given integer or string representation of an integer (between 1 and 3999) into its corresponding Roman numeral. The function first validates the input to ensure it is a valid integer within the specified range. It then processes the input digit by digit, starting from the least significant digit (units place) to the most significant digit (thousands place), and encodes each digit into its Roman numeral equivalent. The encoded digits are then concatenated to form the final Roman numeral string, which is returned as the output. If the input is invalid (not an integer or outside the 1-3999 range), the function raises a `ValueError`."
    },
    {
        "function_name": "__index_for_sign",
        "summary": "This function is used to find the index of a given `sign` within the `__reversed_mappings` attribute of the class `cls`. It iterates through the `__reversed_mappings` list, which is assumed to contain mappings (likely dictionaries or similar structures), and checks if the `sign` exists in any of these mappings. If the `sign` is found, the function returns the corresponding index. If the `sign` is not found in any of the mappings, the function raises a `ValueError` with a message indicating that an invalid token was encountered."
    },
    {
        "function_name": "decode",
        "summary": "This function is used to decode a string representation of a number (likely a Roman numeral) into its corresponding integer value. The function first checks if the input string is non-empty and raises a `ValueError` if it is empty. It then reverses the string to facilitate parsing from the smallest unit to the largest. The function iterates over each character in the reversed string, determines its numeric value based on a predefined mapping (likely Roman numeral values), and adjusts the computed output by adding or subtracting the value depending on the position and order of the characters. The final computed integer value is returned as the result."
    },
    {
        "function_name": "__require_valid_input_and_encoding",
        "summary": "This function is used to validate the input string and encoding provided to it. It checks if the `input_string` is a valid string and not empty, and if the `encoding` is also a valid string. If any of these conditions are not met, the function raises appropriate errors: `InvalidInputError` if the `input_string` is not a valid string, `ValueError` if the `input_string` is empty, or `ValueError` if the `encoding` is not a valid string."
    },
    {
        "function_name": "compress",
        "summary": "This function is used to compress a given input string using the zlib compression library and then encode the compressed data using base64 encoding to ensure it can be safely used in various contexts, such as URLs. The function takes an input string, an optional encoding (defaulting to 'utf-8'), and an optional compression level (defaulting to 9, which is the maximum compression level). It first validates the input and encoding, then converts the string to bytes using the specified encoding, compresses the bytes using zlib, encodes the compressed bytes using base64, and finally returns the result as a string. If the compression level is not an integer between 0 and 9, a ValueError is raised."
    },
    {
        "function_name": "decompress",
        "summary": "This function is used to decompress a previously compressed string that has been encoded in base64. It first validates the input string and encoding, then decodes the base64 string into bytes. These bytes are then decompressed using zlib, and the resulting bytes are decoded back into a string using the specified encoding (defaulting to 'utf-8'). The function ultimately returns the original, decompressed string."
    },
    {
        "function_name": "__init__",
        "summary": "This function is used to initialize an instance of a class by accepting an `input_string` as an argument. It first checks if the provided `input_string` is a valid string using the `is_string` function. If the input is not a valid string, it raises an `InvalidInputError` with the provided input. If the input is valid, it assigns the `input_string` to the instance attribute `self.input_string`."
    },
    {
        "function_name": "__uppercase_first_char",
        "summary": "This function is used to take a matched substring from a regular expression match object (`regex_match`) and return the same substring with its first character converted to uppercase. Specifically, it accesses the entire matched substring using `regex_match.group(0)` and applies the `upper()` method to capitalize the first character of the substring."
    },
    {
        "function_name": "__remove_duplicates",
        "summary": "This function is used to remove duplicates from a matched regular expression group. Specifically, it takes a `regex_match` object as input, accesses the first capturing group (`group(1)`), and returns the first character of that group (`[0]`). This effectively reduces the matched group to a single character, removing any duplicates."
    },
    {
        "function_name": "__uppercase_first_letter_after_sign",
        "summary": "This function is used to uppercase the first letter of a substring that follows a specific sign (likely a punctuation mark or symbol) within a matched string. The function takes a regex match object as input, extracts the matched group, and then modifies the string by capitalizing the third character (index 2) while keeping the rest of the string intact. The modified string is then returned. This is typically used in text processing to ensure proper capitalization after certain characters."
    },
    {
        "function_name": "__ensure_right_space_only",
        "summary": "This function is used to process a matched regular expression group by stripping any leading or trailing whitespace from the first captured group and then appending a single space at the end. Essentially, it ensures that the resulting string has no leading or trailing spaces except for a single space at the end."
    },
    {
        "function_name": "__ensure_left_space_only",
        "summary": "This function is used to ensure that a matched string from a regular expression has only a single space on the left side. It takes a `regex_match` object as input, strips any leading or trailing whitespace from the matched group (group 1), and then prepends a single space to the result. This effectively normalizes the spacing to ensure only one space remains on the left side of the matched string."
    },
    {
        "function_name": "__ensure_spaces_around",
        "summary": "This function is used to ensure that a matched substring from a regular expression has spaces around it. Specifically, it takes a regex match object, extracts the first captured group, strips any leading or trailing whitespace from it, and then returns the result with a single space added before and after the stripped substring. This ensures that the matched text is properly spaced within a larger string."
    },
    {
        "function_name": "__remove_internal_spaces",
        "summary": "This function is used to remove any leading and trailing spaces from the first captured group of a regular expression match. It takes a `regex_match` object as input, extracts the first captured group using `group(1)`, and then applies the `strip()` method to eliminate any spaces at the beginning and end of the captured string. The cleaned string is then returned."
    },
    {
        "function_name": "__fix_saxon_genitive",
        "summary": "This function is used to process a matched regular expression group by removing any spaces within the group and then appending a single space at the end. Specifically, it takes a regex match object, extracts the first captured group, removes all spaces from that group, and returns the modified string with an added space at the end. This is likely used to handle or normalize text, particularly in cases involving possessive forms (e.g., Saxon genitive)."
    },
    {
        "function_name": "__placeholder_key",
        "summary": "This function is used to generate a unique placeholder key by combining a dollar sign ('$') with a randomly generated UUID (Universally Unique Identifier) in hexadecimal format, followed by another dollar sign. The resulting string serves as a unique identifier that can be used as a placeholder in various contexts."
    },
    {
        "function_name": "format",
        "summary": "This function is used to format a given input string by performing several text normalization and prettification steps. It first identifies and temporarily replaces URLs and email addresses in the string with unique placeholder keys to prevent them from being altered during the formatting process. The function then applies a series of regular expression-based transformations to the string, including capitalizing the first letter of words, removing duplicate characters, ensuring proper spacing around punctuation, and fixing Saxon genitive cases. After these transformations, the function restores the original URLs and email addresses by replacing the placeholder keys with their corresponding values. The final formatted string is returned as the output."
    },
    {
        "function_name": "reverse",
        "summary": "This function is used to reverse the characters of a given input string. It takes a single argument, `input_string`, which is expected to be a string. If the input is not a valid string, the function raises an `InvalidInputError`. Otherwise, it returns the string with its characters in reverse order. For example, if the input is `'hello'`, the function will return `'olleh'`."
    },
    {
        "function_name": "camel_case_to_snake",
        "summary": "This function is used to convert a camel case string into a snake case string. It takes an input string and a separator (default is '_') as arguments. If the input string is not a valid camel case string, the function returns the original string unchanged. The conversion is done by inserting the specified separator before each uppercase letter (except the first one) and then converting the entire string to lowercase. For example, the input 'ThisIsACamelStringTest' would be converted to 'this_is_a_camel_string_test'."
    },
    {
        "function_name": "snake_case_to_camel",
        "summary": "This function is used to convert a snake case string (e.g., 'the_snake_is_green') into a camel case string (e.g., 'TheSnakeIsGreen'). It takes an input string, an optional boolean parameter to determine if the first letter should be uppercase (default is True), and an optional separator character (default is '_'). If the input string is not a valid snake case string, the function returns the original string. The function splits the input string by the separator, capitalizes each segment, and then joins them together to form the camel case string. If the `upper_case_first` parameter is set to False, the first letter of the resulting string will be lowercase."
    },
    {
        "function_name": "shuffle",
        "summary": "This function is used to shuffle the characters of a given string in a randomized order and return the shuffled string as a new string. It first checks if the input is a valid string, then converts the string into a list of characters, shuffles the list using the `random.shuffle` method, and finally joins the shuffled list back into a string. The result is a string with the same characters as the input but in a random order."
    },
    {
        "function_name": "strip_html",
        "summary": "This function is used to remove HTML tags from a given string. Depending on the `keep_tag_content` parameter, it can either remove the HTML tags while preserving the content within the tags (if `keep_tag_content` is `True`), or remove both the tags and their content (if `keep_tag_content` is `False`, which is the default behavior). The function raises an `InvalidInputError` if the input is not a string. The result is a string with the HTML code removed according to the specified behavior."
    },
    {
        "function_name": "prettify",
        "summary": "This function is used to reformat a given string by applying a set of grammar and formatting rules to make it more readable and properly structured. The rules include ensuring that the string does not start or end with spaces, capitalizing the first letter of sentences and after punctuation marks, removing multiple sequential spaces and empty lines, properly spacing arithmetic operators, ensuring correct spacing after punctuation, handling text within quotes and brackets, and correcting the Saxon genitive. The function returns a \"prettified\" version of the input string that adheres to these rules."
    },
    {
        "function_name": "asciify",
        "summary": "This function is used to convert a given string into an ASCII-only string by translating all non-ASCII characters into their closest ASCII representations. For example, characters like 'ó' are translated to 'o', 'Ë' to 'E', and 'ç' to 'c'. If a character cannot be translated into an ASCII equivalent, it is removed from the string. The function uses Unicode normalization (NFKD) to handle the translation and then encodes the string to ASCII, ignoring any characters that cannot be represented. The final result is returned as a UTF-8 encoded string."
    },
    {
        "function_name": "slugify",
        "summary": "This function is used to convert a given string into a \"slug\" format, which is a URL-friendly string. The function ensures that the resulting string has no spaces, all letters are in lowercase, and all punctuation and non-alphanumeric characters are removed. Words in the string are separated by a specified separator (default is a hyphen \"-\"). Additionally, the function encodes all characters as ASCII, making the slug safe for use in URLs. The function handles edge cases such as consecutive separators and non-ASCII characters by normalizing and converting them appropriately."
    },
    {
        "function_name": "booleanize",
        "summary": "This function is used to convert a string into a boolean value based on its content. The conversion is case-insensitive, meaning that the function will recognize positive boolean-like values regardless of their casing. Specifically, the function returns `True` if the string is one of the following: \"true\", \"1\", \"yes\", or \"y\". If the string does not match any of these values, the function returns `False`. Additionally, the function raises an `InvalidInputError` if the input is not a string."
    },
    {
        "function_name": "strip_margin",
        "summary": "This function is used to remove the left margin (tab indentation) from each line of a multi-line string. It is inspired by a similar function in Scala. The function processes the input string by splitting it into individual lines, removing the leading whitespace (margin) from each line, and then joining the lines back together into a single string. This is particularly useful for formatting multi-line strings in a way that removes unnecessary indentation, making the output cleaner and more readable."
    },
    {
        "function_name": "compress",
        "summary": "This function is used to compress a given string into a shorter, URL-safe format that can be later decompressed back to its original state using a corresponding `decompress()` function. The compression is achieved using Python's `zlib` and `base64` libraries, and the effectiveness of the compression depends on the size of the input string and the presence of recurring character sequences. The function allows customization of the encoding and compression level, with the default settings being UTF-8 encoding and the highest compression level (9). If the input string is empty, the function raises a `ValueError`."
    },
    {
        "function_name": "decompress",
        "summary": "This function is used to restore a previously compressed string (obtained using `compress()`) back to its original state. It takes two arguments: `input_string`, which is the compressed string to be decompressed, and `encoding`, which specifies the original string encoding (defaulting to 'utf-8'). The function returns the decompressed string by invoking a method from the `__StringCompressor` class."
    },
    {
        "function_name": "roman_encode",
        "summary": "This function is used to convert a given integer or string representing a positive integer into a Roman numeral. The input must be within the range of 1 to 3999 (inclusive) because Roman numerals do not have a representation for zero, and the upper limit is constrained by the ASCII representation of Roman numeral symbols, particularly the symbol 'M' which represents 1000. The function returns the Roman numeral as a string."
    },
    {
        "function_name": "roman_decode",
        "summary": "This function is used to convert a Roman numeral string into its corresponding integer value, provided that the input string is a valid Roman numeral. The function takes a single argument, `input_string`, which is expected to be a string representing a Roman numeral, and returns the integer value of that numeral. For example, if the input is `'VII'`, the function will return `7`. The actual decoding logic is handled by an internal method `__RomanNumbers.decode`."
    },
    {
        "function_name": "uuid",
        "summary": "This function is used to generate a universally unique identifier (UUID) as a string. By default, it returns the UUID in its standard hyphenated format (e.g., '97e3a716-6b33-4ab9-9bb1-8128cb24d76b'). If the `as_hex` parameter is set to `True`, it returns the UUID as a continuous hexadecimal string without hyphens (e.g., '97e3a7166b334ab99bb18128cb24d76b'). The UUID is generated using Python's `uuid.uuid4()` method."
    },
    {
        "function_name": "random_string",
        "summary": "This function is used to generate a random string of a specified length, containing a combination of uppercase and lowercase ASCII letters as well as digits. The function takes an integer `size` as input, which determines the length of the generated string. If the input `size` is not a positive integer, the function raises a `ValueError`. The random string is constructed by selecting characters randomly from the combined set of ASCII letters and digits, and then joining them into a single string. The function returns this randomly generated string."
    },
    {
        "function_name": "secure_random_hex",
        "summary": "This function is used to generate a secure random hexadecimal string by utilizing the `os.urandom` function, which provides cryptographically secure random bytes. The function takes an integer `byte_count` as input, which specifies the number of random bytes to generate. The generated bytes are then converted to a hexadecimal string representation, resulting in a string that is exactly twice the length of the input `byte_count`. The function ensures that the input `byte_count` is a positive integer and raises a `ValueError` if this condition is not met. The final output is a hexadecimal string representing the random bytes."
    },
    {
        "function_name": "roman_range",
        "summary": "This function is used to generate a sequence of Roman numerals in a manner similar to Python's built-in `range()` function. It returns a generator object that yields Roman numerals corresponding to integers in a specified range. The function allows customization of the start, stop, and step values, enabling both forward and backward iteration. The generated Roman numerals are constrained to the range of 1 to 3999, and the function performs validation to ensure the input parameters are within acceptable bounds. If the configuration of start, stop, and step values is invalid (e.g., would cause an infinite loop or exceed boundaries), the function raises an `OverflowError`."
    },
    {
        "function_name": "validate",
        "summary": "This function is used to validate that a given argument (`arg_value`) is an integer within the range of 1 to 3999. If the argument is not an integer, or if it falls outside the specified range, a `ValueError` is raised with a message indicating that the argument must be an integer within the range 1-3999. The function also provides an option (`allow_negative`) to handle negative values by converting them to their absolute value before validation. If `allow_negative` is set to `True`, negative values are allowed and treated as positive values during the validation process."
    },
    {
        "function_name": "generate",
        "summary": "This function is used to generate a sequence of Roman numeral representations for a range of numbers defined by `start`, `stop`, and `step`. It iterates through the range from `start` to `stop`, incrementing by `step` each time, and yields the Roman numeral equivalent of each number using the `roman_encode` function. The function continues to yield values until it reaches the `stop` value, at which point it yields the final Roman numeral representation of the `stop` value."
    },
    {
        "function_name": "__init__",
        "summary": "This function is used to initialize an object by accepting an `input_data` parameter of any type. It then determines the type of `input_data` and constructs an error message indicating that a string was expected but a different type was received. Finally, it calls the parent class's `__init__` method with this error message, effectively raising an exception or passing the message to the parent class for further handling."
    },
    {
        "function_name": "__init__",
        "summary": "This function is used to initialize an instance of a class by accepting an `input_string` and an optional `normalize` parameter. If the `normalize` parameter is set to `True` (default), the function removes all hyphens (`-`) from the `input_string` before assigning it to the instance attribute `self.input_string`. If `normalize` is `False`, the `input_string` is assigned to `self.input_string` without any modifications. Additionally, the function checks if the `input_string` is a valid string using the `is_string` function, and raises an `InvalidInputError` if the input is not a valid string."
    },
    {
        "function_name": "is_isbn_13",
        "summary": "This function is used to determine whether a given input string is a valid ISBN-13 (International Standard Book Number) by checking its length and validating its checksum. The function first checks if the length of the input string is exactly 13 characters. If it is, the function calculates a weighted sum of the digits, where the weight alternates between 1 and 3 for each digit. If the sum is divisible by 10, the function returns `True`, indicating that the input string is a valid ISBN-13. If the input string is not 13 characters long or if any character in the string is not a digit, the function returns `False`."
    },
    {
        "function_name": "is_isbn_10",
        "summary": "This function is used to check if a given input string is a valid ISBN-10 (International Standard Book Number). It verifies the validity by ensuring the string is exactly 10 characters long and then calculating a weighted sum of the digits. If the sum is divisible by 11, the function returns `True`, indicating the string is a valid ISBN-10. If the string is not 10 characters long or contains non-digit characters, the function returns `False`."
    },
    {
        "function_name": "is_string",
        "summary": "This function is used to determine whether a given object is a string. It returns `True` if the object is an instance of the `str` type (i.e., a string), and `False` otherwise. For example, it will return `True` for `'foo'` but `False` for `b'foo'` (which is a bytes object)."
    },
    {
        "function_name": "is_full_string",
        "summary": "This function is used to determine if a given string is not empty and contains at least one non-space character. It returns `True` if the string meets these criteria, and `False` otherwise. The function handles cases where the input is `None`, an empty string, or a string consisting solely of spaces by returning `False`. If the string contains any non-space characters, it returns `True`."
    },
    {
        "function_name": "is_number",
        "summary": "This function is used to check if a given string represents a valid number. The number can be signed or unsigned, an integer or a double, and can also use scientific notation (e.g., 1e5). The function returns `True` if the string is a valid number and `False` otherwise. It raises an `InvalidInputError` if the input is not a string."
    },
    {
        "function_name": "is_integer",
        "summary": "This function is used to determine whether a given string represents an integer. It checks if the string is a valid number and does not contain a decimal point, ensuring that the number is a whole integer. The function returns `True` if the string represents an integer and `False` otherwise. Examples include `'42'` returning `True` and `'42.0'` returning `False`."
    },
    {
        "function_name": "is_decimal",
        "summary": "This function is used to check whether a given string represents a decimal number. It returns `True` if the string is a valid decimal number (which may be signed or unsigned and may include a decimal point), and `False` otherwise. The function specifically requires that the string contains a decimal point to be considered a valid decimal, as indicated by the condition `'.' in input_string`. For example, `'42.0'` would return `True`, while `'42'` would return `False`."
    },
    {
        "function_name": "is_url",
        "summary": "This function is used to check if a given string is a valid URL. It verifies the string against a regular expression pattern (presumably defined by `URL_RE`) to determine if it matches the structure of a URL. Additionally, it allows for an optional list of allowed schemes (e.g., 'http', 'https', 'ftp') to further restrict the validation. If no specific schemes are provided, any valid URL scheme is accepted. The function returns `True` if the string is a valid URL and meets the scheme criteria (if specified), otherwise it returns `False`."
    },
    {
        "function_name": "is_email",
        "summary": "This function is used to validate whether a given string is a valid email address according to the rules specified in RFC 3696. It performs several checks, including ensuring the string is not empty, has a maximum length of 320 characters, and does not start with a dot. The function then splits the string into two parts using the \"@\" symbol and checks that the part before the \"@\" (the local part) is no longer than 64 characters and does not end with a dot or contain multiple consecutive dots. The part after the \"@\" (the domain part) must be no longer than 255 characters. Additionally, the function handles escaped spaces and special cases where the \"@\" symbol is escaped. If all checks pass, the function uses a regular expression (`EMAIL_RE`) to further validate the email format. If any check fails, the function returns `False`; otherwise, it returns `True`."
    },
    {
        "function_name": "is_credit_card",
        "summary": "This function is used to check if a given string is a valid credit card number. It can validate the string against a specific card type (e.g., VISA, MASTERCARD, AMERICAN_EXPRESS, etc.) if provided, or it can check against any known credit card type if no specific type is specified. The function returns `True` if the string matches the criteria for a valid credit card number of the specified type (or any type if none is specified), and `False` otherwise. If an invalid card type is provided, the function raises a `KeyError`."
    },
    {
        "function_name": "is_camel_case",
        "summary": "This function is used to determine whether a given string is formatted in camel case. A string is considered camel case if it meets the following criteria: it consists only of letters (both lowercase and uppercase) and optionally numbers, it contains both lowercase and uppercase letters, and it does not start with a number. The function returns `True` if the string is camel case and `False` otherwise."
    },
    {
        "function_name": "is_snake_case",
        "summary": "This function is used to determine whether a given string is formatted in \"snake case.\" A string is considered to be in snake case if it meets the following criteria: it consists only of lowercase or uppercase letters and digits, contains at least one underscore (or a specified separator), and does not start with a number. The function uses regular expressions to validate the string against these rules and returns `True` if the string is in snake case, otherwise `False`. The separator can be customized, with the default being an underscore (`_`)."
    },
    {
        "function_name": "is_json",
        "summary": "This function is used to check if a given string is a valid JSON. It first verifies that the string is not empty and matches a JSON-like pattern using a regular expression. If the string passes these initial checks, it attempts to parse the string using `json.loads`. If the parsing is successful and the result is either a dictionary or a list, the function returns `True`. If any errors occur during parsing or the string does not match the expected JSON format, the function returns `False`."
    },
    {
        "function_name": "is_uuid",
        "summary": "This function is used to check if a given string is a valid UUID. It can validate both the standard UUID format (e.g., '6f8aa2f9-686c-4ac3-8766-5712354a04cf') and, optionally, the hexadecimal representation of a UUID (e.g., '6f8aa2f9686c4ac387665712354a04cf') if the `allow_hex` parameter is set to `True`. The function returns `True` if the string is a valid UUID according to the specified format, and `False` otherwise."
    },
    {
        "function_name": "is_ip_v4",
        "summary": "This function is used to check if a given string is a valid IPv4 address. It first verifies that the string is not empty and matches a shallow pattern of an IPv4 address using a regular expression. Then, it splits the string by the dot (`.`) delimiter and checks that each segment is an integer within the valid range of 0 to 255. If all segments are valid, the function returns `True`; otherwise, it returns `False`."
    },
    {
        "function_name": "is_ip_v6",
        "summary": "This function is used to check if a given string is a valid IPv6 address. It returns `True` if the string is a valid IPv6 address, and `False` otherwise. The function relies on a regular expression (`IP_V6_RE`) to validate the format of the input string, ensuring it conforms to the IPv6 address structure. Additionally, it checks that the input string is not empty or incomplete using the `is_full_string` function."
    },
    {
        "function_name": "is_ip",
        "summary": "This function is used to determine whether a given string is a valid IP address, either IPv4 or IPv6. It does this by checking the string against both IPv4 and IPv6 formats using helper functions (`is_ip_v6` and `is_ip_v4`). If the string matches either format, the function returns `True`; otherwise, it returns `False`."
    },
    {
        "function_name": "is_palindrome",
        "summary": "This function is used to determine whether a given string is a palindrome. A palindrome is a string that reads the same backward as forward, such as \"otto\" or \"madam\". The function allows for optional parameters to ignore spaces and/or case sensitivity when checking for palindromes. If `ignore_spaces` is set to `True`, any spaces in the string are removed before the check. If `ignore_case` is set to `True`, the function compares characters in a case-insensitive manner. The function returns `True` if the string is a palindrome under the specified conditions, and `False` otherwise."
    },
    {
        "function_name": "is_pangram",
        "summary": "This function is used to determine whether a given string is a pangram, which is a sentence that contains every letter of the alphabet at least once. The function first checks if the input string is a full string (non-empty and not just whitespace). If the string is valid, it removes spaces and checks if the set of characters in the string is a superset of all lowercase letters in the English alphabet. If all letters are present, the function returns `True`; otherwise, it returns `False`."
    },
    {
        "function_name": "is_isogram",
        "summary": "This function is used to determine whether a given string is an isogram. An isogram is a word or phrase that does not contain any repeating letters. The function checks this by comparing the length of the string to the length of the set of characters in the string. If they are equal, it means all characters are unique, and the function returns `True`. Otherwise, it returns `False`. The function also ensures that the input is a non-empty string before performing the check."
    },
    {
        "function_name": "is_slug",
        "summary": "This function is used to check if a given string is a valid slug, typically as created by a `slugify()` function. A slug is a string that consists of lowercase alphanumeric characters and hyphens (or a specified separator), with no spaces or special characters. The function uses a regular expression to validate the input string against the slug format, ensuring it starts and ends with alphanumeric characters and only contains the specified separator in between. If the string matches the slug pattern, the function returns `True`; otherwise, it returns `False`."
    },
    {
        "function_name": "contains_html",
        "summary": "This function is used to check if a given string contains any HTML or XML tags. It is designed to detect the presence of tags in the text, rather than validating the correctness of the HTML/XML structure. The function returns `True` if any tags are found in the input string, and `False` otherwise. It is particularly useful for identifying potentially malicious or undesired tags in text data."
    },
    {
        "function_name": "words_count",
        "summary": "This function is used to count the number of words in a given string. It intelligently identifies words as sequences of one or more letters and/or numbers, ignoring non-alphanumeric characters like punctuation and symbols. The function is designed to handle strings with punctuation, ensuring that words separated by punctuation (e.g., \"one,two,three.stop\") are counted correctly. If the input is not a valid string, the function raises an `InvalidInputError`. The function returns the total count of words found in the input string."
    },
    {
        "function_name": "is_isbn_10",
        "summary": "This function is used to validate whether a given string represents a valid ISBN-10 (International Standard Book Number). By default, the function ignores hyphens in the string, allowing for flexible formatting of the ISBN. However, if the `normalize` parameter is set to `False`, the function will only validate strings that contain digits without any hyphens. The function returns `True` if the string is a valid ISBN-10 and `False` otherwise."
    },
    {
        "function_name": "is_isbn_13",
        "summary": "This function is used to validate whether a given string represents a valid ISBN-13 (International Standard Book Number). By default, the function ignores hyphens in the string, allowing for flexible formatting of the ISBN. However, if the `normalize` parameter is set to `False`, the function will only consider strings that consist solely of digits as valid. The function returns `True` if the string is a valid ISBN-13 and `False` otherwise."
    },
    {
        "function_name": "is_isbn",
        "summary": "This function is used to check if a given string represents a valid ISBN (International Standard Book Number). It can validate both ISBN-10 and ISBN-13 formats. By default, the function ignores hyphens in the string, allowing for flexible formatting of the ISBN. If the `normalize` parameter is set to `False`, the function will only validate strings that consist solely of digits. The function returns `True` if the input string is a valid ISBN, and `False` otherwise."
    }
]